[
  {
    "id": 1,
    "name": "Roy",
    "email": "leoroychan@gmail.com",
    "message": "test"
  },
  {
    "id": 2,
    "name": "pv",
    "email": "e0357487@u.nus.edu",
    "message": "Trial"
  },
  {
    "id": 3,
    "name": "Valli",
    "email": "vpichappan@u.nus.edu",
    "message": "Trial!"
  },
  {
    "id": 4,
    "name": "test",
    "email": "test@gmail.com",
    "message": "hi"
  },
  {
    "id": 5,
    "name": "Chua Zi Han",
    "email": "neocronn@gmail.com",
    "message": "Hi, I am an incoming student. May I know how can I join the society? Thanks"
  },
  {
    "id": 6,
    "name": "Nishant",
    "email": "nishdg@gmail.com",
    "message": "Hello, I am Nishant and I am an incoming Full Time MBA candidate at NUS. We also have instituted a Fintech Club and I would like to explore the opportunities for us to collaborate on various topics involving Fintech. Looking forward to hearing from you. \n\nThnaks"
  },
  {
    "id": 7,
    "name": "Cherrie Liu",
    "email": "cherrie0215@gmail.com",
    "message": "Hi Team, this is Cherrie Liu, intake of NUS MBA 21 Aug. With passion in FinTech, I've recently founded a NUS MBA FinTech Club: https://www.linkedin.com/groups/13976754/. The club was created on 7 Jun, within 1 day we already have nearly 100 members in whatsapp group now. As the founder of this club, I'd like to share this great news with NUS FinTech Society and discuss how we can collaborate in the future. Cheers and look forward to hearing from you soon."
  },
  {
    "id": 8,
    "name": "Cherrie Liu",
    "email": "cherrie0215@gmail.com",
    "message": "Hi Team, this is Cherrie Liu, intake of NUS MBA 21 Aug. With passion in FinTech, I've recently founded a NUS MBA FinTech Club: https://www.linkedin.com/groups/13976754/. The club was created on 7 Jun, within 1 day we already have nearly 100 members in whatsapp group now. As the founder of this club, I'd like to share this great news with NUS FinTech Society and discuss how we can collaborate in the future. Cheers and look forward to hearing from you soon. (Cherrie Liu: cherrie0215@gmail.com)"
  },
  {
    "id": 9,
    "name": "Amanda Lim",
    "email": "amanda.limqh@outlook.com",
    "message": "Dear Sir/Mdm, I am enquiring on behalf of my husband who is currently employed full-time at a local bank and undertaking his Masters in Fintech with SUSS. He has keen interest in Fintech and would like to develop this area of interest further. May I please check if he is able to join this society and also contribute in the activities that are organised?  I am contactable on my mobile at 90038377 too if it is easier to speak. Hope to hear from you soon. Thanks!"
  },
  {
    "id": 10,
    "name": "Vaibhav Agrawal",
    "email": "info@robotechlabs.com",
    "message": "Hi\nWe are interested to hold a event in association with your club, the event can be a hackathon or building a MVP based on the problem statement given by us.\nWe shall provide with  a prize money to the winner.  The event can be open for all.\n\nPlease reach out to us to discuss further."
  },
  {
    "id": 11,
    "name": "Wincent Tjoi",
    "email": "wincenttsjoi@gmail.com",
    "message": "testing website email form"
  },
  {
    "id": 12,
    "name": "Wincent Tjoi",
    "email": "wincenttsjoi@gmail.com",
    "message": "testing website email form"
  },
  {
    "id": 13,
    "name": "Wincent Tjoi",
    "email": "wincenttsjoi@gmail.com",
    "message": "testing website email form"
  },
  {
    "id": 14,
    "name": "Wincent Tjoi",
    "email": "wincenttsjoi@gmail.com",
    "message": "testing website email form"
  },
  {
    "id": 15,
    "name": "Wincent Tjoi",
    "email": "wincenttsjoi@gmail.com",
    "message": "test"
  },
  {
    "id": 16,
    "name": "Wincent Tjoi",
    "email": "wincenttsjoi@gmail.com",
    "message": "test"
  },
  {
    "id": 17,
    "name": "Sumanth Yalamarty",
    "email": "sumanthyalamarty@u.nus.edu",
    "message": "Dear FinTech society\n\nI want to be a part of your team. May I ask when is the recruitment starting for the core team?"
  },
  {
    "id": 18,
    "name": "Sumanth Yalamarty",
    "email": "sumanthyalamarty@u.nus.edu",
    "message": "Dear FinTech society\n\nI want to be a part of your team. May I ask when is the recruitment starting for the core team?"
  },
  {
    "id": 19,
    "name": "Sumanth Yalamarty",
    "email": "sumanthyalamarty@u.nus.edu",
    "message": "Dear FinTech society\n\nI want to be a part of your team. May I ask when is the recruitment starting for the core team?"
  },
  {
    "id": 20,
    "name": "Sumanth Yalamarty",
    "email": "sumanthyalamarty@u.nus.edu",
    "message": "Dear FinTech Society\n\nI want to be a part of your team. May I ask when is the recruitment process starting for the core team?"
  },
  {
    "id": 21,
    "name": "Yihui",
    "email": "yihui.xie@forkast.News",
    "message": "Dear NUS Fintech society, \n\nI am Xie Yihui, a second-year student from Yale-NUS and a research intern at Forkast.News, a blockchain-focused website with over 1 million monthly readers. I am writing an article on how students have been disrupting the blockchain space, and would like to have a chat with your team. Let me know if you are willing to share the important work you've been doing with us! \n\n\nYihui"
  },
  {
    "id": 22,
    "name": "Hari Eshwar Ganesh Raj",
    "email": "harieshwar.g@gmail.com",
    "message": "Hi all,\n\nMyself an incoming grad student at nus school of computing  spring 2022.\nI  deeply wish to be a part of  the NUS fintech society, may I know the  next set of steps I  need to follow to become one among you guys :).\n\nThanks in Advance"
  },
  {
    "id": 23,
    "name": "Chia Jun Zhe Brendan",
    "email": "brendancjz@gmail.com",
    "message": "Hi there, I am a year 1 going year 2 IS major student and I am very interested to join NUS FIntech Society. May I know when is the application date? Thanks!"
  },
  {
    "id": 24,
    "name": "Zephan Hwang",
    "email": "e0540818@u.nus.edu",
    "message": "Hi, I'm interested in joining the NUS fintech society after interning at a blockchain-based start up over the summer vacation period. However, I'm not in nus comp sci; would I still be able to join?"
  },
  {
    "id": 25,
    "name": "Elton",
    "email": "E0412959@u.nus.edu",
    "message": "Looking to join the club. Year 3 BA student"
  },
  {
    "id": 26,
    "name": "kim seung hyun",
    "email": "e0774174@u.nus.edu",
    "message": "i am interested in joining fintech as a freshman. May i have some details about the society. I missed the teatime on aug 6 due to schedule collisions. Many thanks."
  },
  {
    "id": 27,
    "name": "Joshua",
    "email": "joshuachua.yl@u.nus.edu",
    "message": "Hi I'm a year 2 accounting student at NUS, and I'm interested in joining an interest group / club that relates to crypto and blockchain technologies. Although I've missed the welcome tea, I hope to be able to learn a little bit more about your club and possibly also join your upcoming events. :)"
  },
  {
    "id": 28,
    "name": "Hu Tianran",
    "email": "e0665488@u.nus.edu",
    "message": "I'm a Y2 CS student and I'm looking for a chance to expand my horizon beyond academic modules.  Not satisfying with just the content learned in textbook, I'm curious about exploring various applications of my academic knowledge. I think FinTech would be a great place where I can collaborate with many top students and achieve such wishes, so I'd really wish to join in this wonderful team."
  },
  {
    "id": 29,
    "name": "Christopher Tan",
    "email": "e0774066@u.nus.edu",
    "message": "Hi,\nI am Christopher Tan, a CS freshman. I accidentally missed the deadline yesterday for registration for the fintech society. Is it still too late to join? I would love  to learn more about fintech technology. Thank you."
  },
  {
    "id": 30,
    "name": "Christopher Tan",
    "email": "e0774066@u.nus.edu",
    "message": "Hi,\nI am Christopher Tan, a CS freshman. I accidentally missed the deadline yesterday for registration. Is it still too late to join? I would love to explore fintech technology. Thank you."
  },
  {
    "id": 31,
    "name": "John Benedict Yan",
    "email": "johnbenedictyan@u.nus.edu",
    "message": "Good Evening,\n\nI was supposed to have an ML interview this evening however I was not feeling well and could not make it. Is it possible to reschedule the interview? I apologise for the convenience caused.\n\nBest regards\nJohn Benedict Yan"
  },
  {
    "id": 32,
    "name": "Lee Sen Wei",
    "email": "e0905375@u.nus.edu",
    "message": "Hey! Sen wei here. I am a little paranoid, just wanted to check if I actually submitted my sign-up form... Because some of my friends already interviewed today and I have yet to get any emails regarding the interview! So sorry for any inconvenience caused yea haha"
  },
  {
    "id": 33,
    "name": "Tan Ping Yun",
    "email": "tanpingyun99@gmail.com",
    "message": "Hi, I recently applied for the machine learning analyst position. However, I did not receive any email regarding the interview or and updates on my application. Can I check if there are any updates?"
  },
  {
    "id": 34,
    "name": "Lim Xin Yi",
    "email": "limxinyii14@gmail.com",
    "message": "Hello, \n\nI am aware that recruitment has just ended for AY21/22 but is it possible to still join the society? I am interested in the Blockchain Department as I am an enthusiast myself and would love to join NUS Fintech Society to pursue this interest of mine :) Otherwise, you guys open up for recruitment in the next semester? \n\nThank you!\n\nBest Regards,\nXin Yi"
  },
  {
    "id": 35,
    "name": "Pojcharapol Leenukiat",
    "email": "e0550642@u.nus.edu",
    "message": "Hi!\n\nMay I follow up on my application for Machine Learning Department's Tech Analyst Trainee? I'm very interested to join the society, and I would be appreciate for any update you can provide. Looking forward to hearing from you, thank you.\n\nPojcharapol Leenukiat"
  },
  {
    "id": 36,
    "name": "Torben Leowald",
    "email": "torben.leowald@u.nus.edu",
    "message": "Hey NUS Fintech Society, \n\nmy name is Torben Leowald and I started my master studies in Finance last month at NUS, before that, I conducted my undergraduate degree in Computer Science and Management at the Technical University Munich. I just came across your website and wondered if there exists the possibility to join the society? \nBest \nTorben"
  },
  {
    "id": 37,
    "name": "Gerren Seow",
    "email": "gerrenseow@gmail.com",
    "message": "Testing to see if this is working!"
  },
  {
    "id": 38,
    "name": "Gerren Seow",
    "email": "gerrenseow@gmail.com",
    "message": "Testing again!"
  }
]