[
  {
    "id": 1,
    "imageUrls": [
      {
        "id": 15,
        "url": "https://cdn.ttgtmedia.com/visuals/ezines/carousel/ezine_security_03.jpg",
        "project": 1
      }
    ],
    "title": "Credit Model Sabotage Using Adversarial AI",
    "details": "Artificial Neural Networks are increasingly being used for risk management purposes like fraud detection or credit risk analysis in the finance industry. Adversarial AI is an AI technique that attempts to fool models through malicious input. They cause AI systems to malfunction in the form of Evasion or Poisoning. This threatens the adoption of AI in risk analytics. This project demonstrates how adversarial techniques can be used to sabotage otherwise high performing credit risk models.\r\n\r\nThe team was able to demonstrate that an Artificial Neural Network trained with over 99% accuracy in detecting credit fraud could be attacked to the level of having less than 11% accuracy.",
    "department": 2
  },
  {
    "id": 2,
    "imageUrls": [
      {
        "id": 1,
        "url": "https://i.imgur.com/LRTL24O.jpeg",
        "project": 2
      }
    ],
    "title": "Charity Chain",
    "details": "People often find themselves skeptical of donations to charity organizations, such as the organization's authenticity and usage of funds. This proof of concept project aims to build a public, user-friendly platform that makes the identification of any charity and your own record of donation simple.",
    "department": 3
  },
  {
    "id": 3,
    "imageUrls": [
      {
        "id": 2,
        "url": "https://i.imgur.com/u0CDY0p.png",
        "project": 3
      }
    ],
    "title": "E-Auction Platform",
    "details": "Centralized E-Auctions face the problems of a lack of trust from participants, hidden middlemen costs and a risk of corruption. This decentralized application demonstrates how the trust, authenticity and anonymity of auction bids can be improved by migrating to a blockchain-based system.",
    "department": 3
  },
  {
    "id": 4,
    "imageUrls": [
      {
        "id": 3,
        "url": "https://i.imgur.com/3cW4VHI.jpg",
        "project": 4
      }
    ],
    "title": "Game",
    "details": "The vast majority of online games stores store in-gamg data on a centralized server, with gamers lacking personal ownership of valuable in-game items and vulnerable to hacks and game-economy manipulation. Blockchain, as a distributed database is able to return this ownership to the gamers. In this proof of concept, we demonstrate how games can be built on top of a distributed platform such as Ethereum.",
    "department": 3
  },
  {
    "id": 5,
    "imageUrls": [
      {
        "id": 4,
        "url": "https://i.imgur.com/3EqGcyl.jpg",
        "project": 5
      },
      {
        "id": 5,
        "url": "https://i.imgur.com/smEVkUx.jpg",
        "project": 5
      },
      {
        "id": 6,
        "url": "https://i.imgur.com/qTgplJb.png",
        "project": 5
      }
    ],
    "title": "Singapore Fintech Festival",
    "details": "For the Singapore Fintech Festival (SFF) event 2020, our society collaborated with Monetary Authority of Singapore and the other institutes of higher learning for the Talent Pavilion Segment (TP).  TP is a one-stop-shop for jobs and skills focusing on Professionals, Managers, Executives and Technicians (PMETs), career switchers, students and fresh graduates to meet their talent-related needs. It is a partnership involving government agencies, labour movement, institutes of higher learning and industry collaborating to reimagine and redefine the future of work in the growing Technology space.\r\n\r\nOur corporate partners include Grab, Seedly, the Fifth Person and Endowus. Collaborating from the public sector, Mr. Patrick Tay (Assistant Secretary General of NTUC) connected us to the chairman of the hawkers association, Mr. Anthony. He welcomed our efforts in the community outreach programme during which our volunteers approached the general public and had informal coffee chats at hawker centres about FinTech. By walking the ground in the heartlands of Boon Lay, Tiong Bahru, Ghim Moh, Clementi, Ang Mo Kio and Bedok, we were able to obtain valuable feedback on the public’s perceptions towards FinTech which could help inform our approach towards tailoring our programmes to suit the public’s needs. Additionally, this community outreach allowed us to drive interest in the Singapore FinTech Festival’s Talent Pavilion event. Within a week of launch, due to our publicity efforts, we were able to drive 34,000 visitors to the talent pavilion website (www.talentpavilion.sg)\r\n\r\nThe FinTech Society was actively involved in planning and execution of the FinTech Literacy in Heartlands programme and the Round Table Discussions from 7 December, 2020 to 10th December 2020 as part of Talent Pavilion and SFF 2020. Our society is proud to have been able to collaborate with the Monetary Authority of Singapore for the third time this year.",
    "department": 1
  },
  {
    "id": 6,
    "imageUrls": [
      {
        "id": 18,
        "url": "https://cdn.i.haymarketmedia.asia/?n=corporate-treasurer%2Fcontent%2FDigital+brain.jpg&h=270&w=405&q=100&v=20150902&c=1",
        "project": 6
      }
    ],
    "title": "Collaboration with BNP Paribas Corporate Treasury",
    "details": "BNP Paribas is a French Multinational Bank that offers clients solutions for capital markets, securities services, financing, treasury and financial advisory. NUS Fintech Society is collaborating with their Corporate Treasury unit to work on interesting projects like Cash Flow Forecasting and Fraud Detection.\r\n\r\nCash Flow Forecasting:\r\nCreating a cash flow forecasting model for BNPP clients to have a clearer understanding of their working capital\r\n\r\nFraud Detection\r\nCreating a transparent and interpretable model to detect corporate fraud",
    "department": 2
  },
  {
    "id": 7,
    "imageUrls": [
      {
        "id": 17,
        "url": "https://inteng-storage.s3.amazonaws.com/img/iea/yrwQLAdm6N/sizes/41296772825-ab170e39f3-k_resize_md.jpg",
        "project": 7
      }
    ],
    "title": "Algo Trading",
    "details": "Our algo trading teams experiment with and try out cutting edge machine learning algorithms for trading. Previous works include Generative Adversarial Networks for price prediction, and a comprehensive Comparison of Prophet, LSTM and Decision Trees for Price Signal prediction.\r\n\r\nThe current teams are working on:\r\n-\tReinforcement learning for Cryptocurrency trading\r\n-\tPaper trading of algorithms like pairs trading, leveraged ETF on Quantconnect\r\n-\tOngoing Collaborating with NUS Fintech Lab on this topic",
    "department": 2
  },
  {
    "id": 8,
    "imageUrls": [
      {
        "id": 16,
        "url": "https://thumbor.forbes.com/thumbor/fit-in/1200x0/filters%3Aformat%28jpg%29/https%3A%2F%2Fspecials-images.forbesimg.com%2Fimageserve%2F5f5afcbb8de14d399113ebc7%2F0x0.jpg",
        "project": 8
      }
    ],
    "title": "Natural Language Processing of Financial News",
    "details": "Increasingly, many investors are looking to alternative data to find buy signals for stocks. The most popular of which is Sentiment Analysis since the price of a stock is usually highly correlated with market sentiment. \r\n\r\nPreviously, our members built a sentiment analysis dashboard for Financial Data provider SmartKarma which scored stocks based on market outlook. \r\n\r\nCurrently, our members are also creating a public web application to implement markets sentiment analysis on Financial News. This will be available for use soon on the Fintech website.\r\n\r\nIn addition, our training wing members are all trying their hand at building their own NLP model for stock price signal prediction.",
    "department": 2
  },
  {
    "id": 9,
    "imageUrls": [
      {
        "id": 7,
        "url": "https://i.imgur.com/2yn8fcI.png",
        "project": 9
      },
      {
        "id": 8,
        "url": "https://i.imgur.com/KxqMBPc.png",
        "project": 9
      },
      {
        "id": 9,
        "url": "https://i.imgur.com/xyIndKb.png",
        "project": 9
      },
      {
        "id": 10,
        "url": "https://i.imgur.com/cn0svlA.png",
        "project": 9
      }
    ],
    "title": "Smart Finance",
    "details": "Organize expenses, learn from spending patterns, and manage finances optimally with the help of an analysis dashboard and a Robo Advisor.",
    "department": 4
  },
  {
    "id": 10,
    "imageUrls": [
      {
        "id": 11,
        "url": "https://i.imgur.com/0dCMHS1.png",
        "project": 10
      },
      {
        "id": 12,
        "url": "https://i.imgur.com/X56MP8f.png",
        "project": 10
      },
      {
        "id": 13,
        "url": "https://i.imgur.com/SXqCUwi.png",
        "project": 10
      },
      {
        "id": 14,
        "url": "https://i.imgur.com/rw6U3W1.png",
        "project": 10
      }
    ],
    "title": "FintechFolio",
    "details": "FintechFolio is a personal finance app designed to help NUS students save money, plan for their future, and view all their finances in one place. With FintechFolio, students can keep track of their daily expenses automatically with bank synchronization. Based on their financial goals and daily expenses history, they can create daily budgets to save better and achieve their financial goals sooner. In order for students to further enhance their experience in personal finance, our app provides daily FinTech news, promotional deals and education on finance and investments.With one place to keep track of their personal finance as well as learn more about finance, investments and FinTech, there’s no need to log into multiple sites. Students can access their personal finance app from anywhere, on any device.",
    "department": 4
  },
  {
    "id": 11,
    "imageUrls": [
      {
        "id": 19,
        "url": "https://i.imgur.com/BDWVmwv.png",
        "project": 11
      },
      {
        "id": 20,
        "url": "https://i.imgur.com/rFJu3xv.png",
        "project": 11
      },
      {
        "id": 21,
        "url": "https://i.imgur.com/GXZ6p3f.png",
        "project": 11
      }
    ],
    "title": "NUS Fintech Month Microsite",
    "details": "Fintech Month Website 2021 was built in collaboration with the Operations department. The website's main homepage has a countdown timer for the event and other components in the website include information on the event overview, workshops, partners, etc. It is a static website built using ReactJS framework and Material UI design, whilst hosted using Firebase. Throughout the process, the engineering team practiced proper project management and releases using JIRA tools, and practiced Agile methodology to keep the development process adaptable to any product requirement changes during the period.",
    "department": 4
  },
  {
    "id": 12,
    "imageUrls": [
      {
        "id": 22,
        "url": "https://i.imgur.com/6Pj0nda.jpg",
        "project": 12
      },
      {
        "id": 23,
        "url": "https://i.imgur.com/Nyth7Cx.jpg",
        "project": 12
      },
      {
        "id": 24,
        "url": "https://i.imgur.com/yEMtjAQ.jpg",
        "project": 12
      },
      {
        "id": 25,
        "url": "https://i.imgur.com/8OX3iwh.jpg",
        "project": 12
      },
      {
        "id": 26,
        "url": "https://i.imgur.com/JXs0lg3.jpg",
        "project": 12
      },
      {
        "id": 27,
        "url": "https://i.imgur.com/SY14G9L.jpg",
        "project": 12
      },
      {
        "id": 28,
        "url": "https://i.imgur.com/ESZQXLG.jpg",
        "project": 12
      },
      {
        "id": 29,
        "url": "https://i.imgur.com/AvJ4JoB.jpg",
        "project": 12
      }
    ],
    "title": "NUS FinTech Month",
    "details": "FinTech Month is a series of workshops and hackathon designed to give tertiary students an insight into the world of FinTech. Through this one month of engaging activities catered to all tertiary students regardless of their background, we aimed to create an inclusive environment and encourage more people to explore this emerging field. Despite this being our very first iteration of FinTech Month, we’re extremely proud and thankful to have received an overwhelming response of over 800 sign-ups. Please continue to look forward to our subsequent iterations in future years!",
    "department": 1
  }
]